In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
path = "worksheet.db"
assert os.path.exists(path)
c = sqlite3.connect(path)

In [3]:
import sqlite3
c = sqlite3.connect("worksheet.db")

def qry(sql):
    return pd.read_sql(sql, c)

species = qry("SELECT * FROM species")
trees = qry("SELECT * FROM trees")
hydrants = qry("SELECT * FROM hydrants")

In [4]:
#q1(a)
trees[trees["priority"] > 90][["x", "y"]] # convert to SQL

    x  y
1  20  4
4  50  4

In [5]:
#q1(b)
qry("SELECT x, y FROM trees WHERE priority > 90")

    x  y
0  20  4
1  50  4

In [6]:
#q2(a)
qry("SELECT x+y FROM trees WHERE species = 'm'") # convert to Pandas

   x+y
0   14
1   24
2   54

In [7]:
#q2(b)
maples = trees[trees["species"] == "m"]
maples["x"] + maples["y"]

0    14
1    24
4    54
dtype: int64

In [8]:
#q3(a)
cd = species["code"][species["species"]=="maple"].iloc[0]
trees[trees["species"] == cd]["tree"] # convert to 2 SQL queries

0    A
1    B
4    E
Name: tree, dtype: object

In [9]:
#q3(b)
cd = qry("SELECT code FROM species WHERE species == 'maple'").iloc[0,0]
qry("SELECT tree FROM trees WHERE species = '{}'".format(cd))

  tree
0    A
1    B
2    E

In [10]:
#q4
qry("SELECT species FROM trees ORDER BY priority DESC")

  species
0       m
1       m
2       m
3       p
4       p

In [11]:
#q5
list(qry("SELECT tree, priority FROM trees " +
         "ORDER BY priority DESC LIMIT 1").iloc[0])

['B', 100]

In [12]:
#q6
qry("""SELECT COUNT(SPECIES) AS c1,
              COUNT(DISTINCT SPECIES) as c2
       FROM trees""")

   c1  c2
0   5   2

In [13]:
#q7
qry("""SELECT species, COUNT(SPECIES) AS count,
              AVG(diameter) AS size
       FROM trees
       GROUP BY species ORDER BY count DESC""")

  species  count  size
0       m      3  10.0
1       p      2   7.0

In [14]:
#q8
qry("SELECT color, year FROM hydrants WHERE color = 'blue' ")

  color  year
0  blue  2010
1  blue  2014
2  blue  2018

In [15]:
#q9
df = qry("SELECT color, year FROM hydrants")
df[df.color == "blue"]

  color  year
3  blue  2010
4  blue  2014
5  blue  2018

In [16]:
#q10
qry("SELECT year FROM hydrants WHERE owner='private' AND active")

   year
0  2001

In [17]:
#q11
df = qry("SELECT year, style, active FROM hydrants")
df[df.active == 1]["style"]

2    Pacer
3    Pacer
4    Pacer
5    Pacer
Name: style, dtype: object

In [18]:
#q12(a)
hydrants["color"].value_counts() # convert to SQL

blue     3
red      2
green    1
Name: color, dtype: int64

In [19]:
#q12(b)
qry("SELECT color, COUNT(*) FROM hydrants GROUP BY color")

   color  COUNT(*)
0   blue         3
1  green         1
2    red         2

In [20]:
#q13
qry("""SELECT color, COUNT(*) FROM hydrants
       WHERE active GROUP BY color""")

   color  COUNT(*)
0   blue         3
1  green         1

In [21]:
#q14
qry("""SELECT color, COUNT(*) AS count FROM hydrants
       GROUP BY color HAVING count > 1""")

  color  count
0  blue      3
1   red      2

In [22]:
#q15
qry("""SELECT color, COUNT(*) AS count
       FROM hydrants WHERE year >= 2000
       GROUP BY color HAVING count < 2""")

   color  count
0  green      1
1    red      1